Update README.md: added mermaid chart
